int/auto/OWSWSMigration/resources/dataBank/TeamEnv/Req/updateHouseKeepingRoomStatus_39562.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl">
   <soapenv:Header>
      <OGHeader primaryLangID="E" timeStamp="2004-03-22T15:25:01.4625000-05:00" transactionID="1100" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <Origin entityID="PROPCH1" systemType="WEB"/>
         <Destination entityID="TI" systemType="ORS"/>
         <Authentication>
            <UserCredentials>
               <UserName>SUPERVISOR</UserName>
               <UserPassword>SCRUMBIZ10</UserPassword>
               <Domain>NIRMAL</Domain>
            </UserCredentials>
         </Authentication>
      </OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:FetchNameRequest>
         <name:NameID source="OPERA" type="INTERNAL">3130251</name:NameID>
      </name:FetchNameRequest>
   </soapenv:Body>
</soapenv:Envelope>